app/controllers/users_controller.rb

  def index
    @users = User.all
    if @users.present?
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("rider_name", "city", "security_amount", "contact_number", "pay_type", "onboarding_type", "receiver_name", "receiver_number", "week_advance", "amount", "client_name", "aadhaar_card_number", "pan_number", "bank_account_details", "current_address", "vehicle_number", "charger_number", "battery_one", "battery_two", "remark", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "city" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["city", "jkjh"], ["updated_at", "2023-08-01 09:45:08.108114"], ["id", 4]]